Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ0512EFF064.atdf
         <register caption="" name="RPF3R" offset="0x10c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF3R"/>
         </register>
         <register caption="" name="RPF4R" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF4R"/>
         </register>
         <register caption="" name="RPF5R" offset="0x114" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPF5R"/>
         </register>
         <register caption="" name="RPG6R" offset="0x158" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG6R"/>
         </register>
         <register caption="" name="RPG7R" offset="0x15c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG7R"/>
         </register>
         <register caption="" name="RPG8R" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG8R"/>
         </register>
         <register caption="" name="RPG9R" offset="0x164" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="RPG9R"/>
         </register>
      </register-group>
   </module>
   <module caption="" id="00748" name="RTCC" version="2">
      <register-group name="RTCC">
         <register caption="Real-Time Clock and Calendar Control Register" name="RTCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="RTCC Output Enable bit" mask="0x00000001" name="RTCOE" values="RTCCON__RTCOE"/>
            <bitfield caption="Half-Second Status bit" mask="0x00000002" name="HALFSEC" values="RTCCON__HALFSEC"/>
            <bitfield caption="Real-Time Clock Value Registers Read Synchronization bit" mask="0x00000004" name="RTCSYNC" values="RTCCON__RTCSYNC"/>
            <bitfield caption="Real-Time Clock Value Registers Write Enable bit" mask="0x00000008" name="RTCWREN" values="RTCCON__RTCWREN"/>
            <bitfield caption="RTCC Clock Enable Status bit" mask="0x00000040" name="RTCCLKON" values="RTCCON__RTCCLKON"/>
            <bitfield caption="RTCC Output Data Select bits" mask="0x00000180" name="RTCOUTSEL" values="RTCCON__RTCOUTSEL"/>
            <bitfield caption="RTCC Clock Select bits" mask="0x00000600" name="RTCCLKSEL" values="RTCCON__RTCCLKSEL"/>
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="RTCCON__SIDL"/>
            <bitfield caption="RTCC On bit" mask="0x00008000" name="ON" values="RTCCON__ON"/>
            <bitfield caption="Real-Time Clock Drift Calibration bits" mask="0x03FF0000" name="CAL" values="RTCCON__CAL"/>
         </register>
         <register caption="Real-Time Clock ALARM Control Register" name="RTCALRM" offset="0x10" rw="RW" size="4">
            <bitfield caption="Alarm Repeat Counter Value bits" mask="0x000000FF" name="ARPT" values="RTCALRM__ARPT"/>
            <bitfield caption="Alarm Mask Configuration bits" mask="0x00000F00" name="AMASK" values="RTCALRM__AMASK"/>
            <bitfield caption="Alarm Sync bit" mask="0x00001000" name="ALRMSYNC" values="RTCALRM__ALRMSYNC"/>
            <bitfield caption="Alarm Pulse Initial Value bit" mask="0x00002000" name="PIV" values="RTCALRM__PIV"/>
            <bitfield caption="Chime Enable bit" mask="0x00004000" name="CHIME" values="RTCALRM__CHIME"/>
            <bitfield caption="Alarm Enable bit" mask="0x00008000" name="ALRMEN" values="RTCALRM__ALRMEN"/>
         </register>
         <register caption="Real-Time Clock Time Value Register" name="RTCTIME" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01"/>
            <bitfield mask="0x0000F000" name="SEC10"/>
            <bitfield mask="0x000F0000" name="MIN01"/>
            <bitfield mask="0x00F00000" name="MIN10"/>
            <bitfield mask="0x0F000000" name="HR01"/>
            <bitfield mask="0xF0000000" name="HR10"/>
         </register>
         <register caption="Real-Time Clock Date Value Register" name="RTCDATE" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01"/>
            <bitfield mask="0x00000F00" name="DAY01"/>
            <bitfield mask="0x0000F000" name="DAY10"/>
            <bitfield mask="0x000F0000" name="MONTH01"/>
            <bitfield mask="0x00F00000" name="MONTH10"/>
            <bitfield mask="0x0F000000" name="YEAR01"/>
            <bitfield mask="0xF0000000" name="YEAR10"/>
         </register>
         <register caption="Alarm Time Value Register" name="ALRMTIME" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000F00" name="SEC01"/>
            <bitfield mask="0x0000F000" name="SEC10"/>
            <bitfield mask="0x000F0000" name="MIN01"/>
            <bitfield mask="0x00F00000" name="MIN10"/>
            <bitfield mask="0x0F000000" name="HR01"/>
            <bitfield mask="0xF0000000" name="HR10"/>
         </register>
         <register caption="Alarm Date Value Register" name="ALRMDATE" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="WDAY01"/>
            <bitfield mask="0x00000F00" name="DAY01"/>
            <bitfield mask="0x0000F000" name="DAY10"/>
            <bitfield mask="0x000F0000" name="MONTH01"/>
            <bitfield mask="0x00F00000" name="MONTH10"/>
         </register>
      </register-group>
      <value-group caption="RTCC Output Enable bit" name="RTCCON__RTCOE">
         <value caption="RTCC output is enabled" name="" value="0x1"/>
         <value caption="RTCC output is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Half-Second Status bit" name="RTCCON__HALFSEC">
         <value caption="Second half period of a second" name="" value="0x1"/>
         <value caption="First half period of a second" name="" value="0x0"/>
      </value-group>
      <value-group caption="Real-Time Clock Value Registers Read Synchronization bit" name="RTCCON__RTCSYNC">
         <value caption="Real-time clock value registers can change while reading (due to a rollover ripple that results in an invalid data read). If the register is read twice and results in the same data" name="" value="0x1"/>
         <value caption="Real-time clock value registers can be read without concern about a rollover ripple" name="" value="0x0"/>
      </value-group>
