Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ0512EFF064.atdf
      <value-group caption="Group2 Read Permissions bits" name="SBT12RD0__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT12RD0__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT13RD0__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT13RD0__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT13RD0__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT13RD0__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT0WR0__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT0WR0__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT0WR0__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT0WR0__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT0WR1__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT0WR1__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT0WR1__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT0WR1__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT1WR0__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT1WR0__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT1WR0__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT1WR0__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT1WR2__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT1WR2__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0"/>
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT1WR2__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1"/>
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0"/>
      </value-group>
